% rebase('layout.tpl', title='Home Page', year=year)


<h3>
    <a href="https://ru.wikipedia.org/wiki/Остовное_дерево">О́стовное де́рево графа</a> (англ. Spanning tree) — это дерево, подграф данного графа, с тем же числом вершин, что и у исходного графа.
    Неформально говоря, остовное дерево получается из исходного графа удалением максимального числа рёбер, входящих в циклы, но без нарушения связности графа.
    Остовное дерево включает в себя все {\displaystyle n}n вершин исходного графа и содержит {\displaystyle n-1}n-1 ребро.
</h3>